# CannotEditRenamedWorkset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotEditRenamedWorkset Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't edit workset ' [Name] '.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotEditRenamedWorkset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotEditRenamedWorkset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotEditRenamedWorkset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace